# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names=pd.read_csv('https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True)

In [5]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names.value_counts('Gender')

Gender
F    558846
M    457549
dtype: int64

### Step 7. Group the dataset by name and assign to names

In [10]:
names = baby_names.groupby('Name')
names

### Step 8. How many different names exist in the dataset?

In [26]:
names['Name'].value_counts()

Name     Name
Aaban    Aaban        2
Aadan    Aadan        4
Aadarsh  Aadarsh      1
Aaden    Aaden      196
Aadhav   Aadhav       1
                   ...
Zyra     Zyra         7
Zyrah    Zyrah        2
Zyren    Zyren        1
Zyria    Zyria       10
Zyriah   Zyriah       9
Name: Name, Length: 17632, dtype: int64

### Step 9. What is the name with most occurrences?

In [14]:
names['Name'].value_counts().sort_values(ascending=False)

Name     Name
Riley    Riley      1112
Avery    Avery      1080
Jordan   Jordan     1073
Peyton   Peyton     1064
Hayden   Hayden     1049
                    ...
Ethon    Ethon         1
Malajah  Malajah       1
Euan     Euan          1
Azyria   Azyria        1
Nissen   Nissen        1
Name: Name, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [33]:
names['Name'].value_counts().sort_values(ascending=True)

Name       Name
Katherina  Katherina       1
Breyona    Breyona         1
Greidy     Greidy          1
Shriyan    Shriyan         1
Briah      Briah           1
                        ...
Hayden     Hayden       1049
Peyton     Peyton       1064
Jordan     Jordan       1073
Avery      Avery        1080
Riley      Riley        1112
Name: Name, Length: 17632, dtype: int64

### Step 11. What is the median name occurrence?

In [53]:
names.median()

           Year  Count
Name
Aaban    2013.5    6.0
Aadan    2008.5    5.5
Aadarsh  2009.0    5.0
Aaden    2010.0   10.0
Aadhav   2014.0    6.0
...         ...    ...
Zyra     2013.0    6.0
Zyrah    2012.0    5.5
Zyren    2013.0    6.0
Zyria    2008.0    6.0
Zyriah   2009.0    6.0

[17632 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [40]:
names.std()

             Year      Count
Name
Aaban    0.707107   0.000000
Aadan    2.872281   0.957427
Aadarsh       NaN        NaN
Aaden    2.044322  21.154974
Aadhav        NaN        NaN
...           ...        ...
Zyra     2.115701   1.154701
Zyrah    1.414214   0.707107
Zyren         NaN        NaN
Zyria    2.685351   0.737865
Zyriah   2.915476   1.666667

[17632 rows x 2 columns]

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [48]:
baby_names.describe(include='all')

           Name          Year   Gender    State         Count
count   1016395  1.016395e+06  1016395  1016395  1.016395e+06
unique    17632           NaN        2       51           NaN
top       Riley           NaN        F       CA           NaN
freq       1112           NaN   558846    76781           NaN
mean        NaN  2.009053e+03      NaN      NaN  3.485012e+01
std         NaN  3.138293e+00      NaN      NaN  9.739735e+01
min         NaN  2.004000e+03      NaN      NaN  5.000000e+00
25%         NaN  2.006000e+03      NaN      NaN  7.000000e+00
50%         NaN  2.009000e+03      NaN      NaN  1.100000e+01
75%         NaN  2.012000e+03      NaN      NaN  2.600000e+01
max         NaN  2.014000e+03      NaN      NaN  4.167000e+03

In [50]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 5 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   Name    1016395 non-null  object
 1   Year    1016395 non-null  int64
 2   Gender  1016395 non-null  object
 3   State   1016395 non-null  object
 4   Count   1016395 non-null  int64
dtypes: int64(2), object(3)
memory usage: 38.8+ MB